export const ROLE_COLOR = '#EF4444';
export const ROLE_GRADIENT: [string, string] = ['#EF4444', '#F87171'];

export const STEPS = [
  {
    id: 1,
    title: 'Личная визитка',
    sub: 'Это то, что родитель увидит в первую очередь',
  },
  {
    id: 2,
    title: 'Профессиональный фильтр',
    sub: 'Данные для системы и администратора',
  },
  {
    id: 3,
    title: 'Маркетинг и продажи',
    sub: 'Дополнительная информация для профиля',
  },
];

export const CITIES = [
  'Астана',
  'Алматы',
  'Шымкент',
  'Караганда',
  'Актобе',
  'Тараз',
  'Павлодар',
  'Усть-Каменогорск',
  'Семей',
  'Атырау',
  'Костанай',
  'Кызылорда',
  'Уральск',
  'Петропавловск',
  'Актау',
];

export const SPECIALIZATIONS = [
  'Психолог',
  'Профориентолог',
  'Тьютор по Hard Skills',
  'Тренер по Soft Skills',
  'Другая специализация',
];

export const PREDEFINED_SKILLS = [
  '#Лидерство',
  '#ЭмоциональныйИнтеллект',
  '#IT',
  '#КритическоеМышление',
  '#Креативность',
  '#Коммуникация',
  '#Тайм-менеджмент',
  '#Командная работа',
  '#Программирование',
  '#Дизайн',
  '#Публичные выступления',
];
